{
  "en": {
    "nav_blog": "Blog",
    "nav_about": "About",
    "nav_contact": "Contact",
    "footer_privacy": "Privacy Policy",
    "footer_terms": "Terms of Service",
    "footer_copyright": "© 2025 Image-Guy.com | All Rights Reserved.",
    "home_title": "Smart Image Compressor",
    "home_subtitle": "Instantly compress, convert, and crop your images in seconds. Free and secure.",
    "home_upload_title": "Drag & Drop Your File Here",
    "home_upload_or": "or",
    "home_upload_button": "Choose File",
    "home_mission_title": "A Small Footprint, One Pixel at a Time.",
    "home_mission_text": "Every image you optimize doesn't just save space, it saves energy. Less data transfer and storage mean a smaller digital footprint for a healthier planet. Join us in making the web faster and greener.",
    "home_howitworks_title": "How It Works",
    "home_howitworks_step1_title": "1. Upload Image",
    "home_howitworks_step1_text": "Drag & drop your files.",
    "home_howitworks_step2_title": "2. Choose Format",
    "home_howitworks_step2_text": "Select your desired output format.",
    "home_howitworks_step3_title": "3. Optimize",
    "home_howitworks_step3_text": "Our server compresses your images while preserving quality. The compression ratio is shown as a percentage.",
    "home_howitworks_step4_title": "4. Edit & Review",
    "home_howitworks_step4_text": "Crop your image if necessary.",
    "home_howitworks_step5_title": "5. Download",
    "home_howitworks_step5_text": "Download your image.",
    "home_howitworks_step6_title": "6. Privacy",
    "home_howitworks_step6_text": "Our server deletes automatically all uploaded pictures within 24 hours.",
    "home_announcement": "Welcome.  Herzlich Willkommen.  Hoş geldiniz.  欢迎.  ",
    "quality_label": "Quality:",
    "contact_title": "Contact Us",
    "contact_intro": "If you have any questions, feedback, or suggestions, we'd love to hear from you. The best way to reach us is by email.",
    "contact_email_header": "Email",
    "contact_phone_header": "Business Phone",
    "contact_outro": "We'll do our best to get back to you as soon as possible.",
    "about_title": "About Image Guy",
    "about_mission": "Our mission is to provide a fast, free, and easy-to-use tool for everyone to optimize their images for the web. We believe in a faster, more efficient, and greener internet.",
    "about_why_header": "Why Optimize?",
    "about_why_text": "Every image you optimize doesn't just improve your website's loading speed; it also reduces the energy required for data transfer and storage. This means a smaller digital footprint and a small but meaningful contribution to a more sustainable planet.",
    "about_tech_header": "Our Technology",
    "about_tech_text": "Image Guy is powered by the high-performance `sharp` library, running on a scalable serverless architecture. This allows us to offer top-tier optimization for various formats like JPEG, PNG, WebP, and AVIF without compromising on quality.",
    "blog_title": "Image Guy Blog",
    "blog_subtitle": "Tips, tricks, and insights on image optimization and web performance.",
    "blog_post1_title": "How Does Image Optimization Save Our Planet?",
    "blog_post1_excerpt": "Learn why optimizing images is critical for site speed, sustainability, and SEO, with practical tips for better web performance.",
    "blog_read_more": "Read More →",
    "terms_title": "Terms of Service",
    "terms_last_updated": "Last updated: July 20, 2025",
    "terms_section1_title": "1. Acceptance of Terms",
    "terms_section1_text": "By accessing and using Image Guy (\"the Service\"), you accept and agree to be bound by the terms and provisions of this agreement.",
    "terms_section2_title": "2. Description of Service",
    "terms_section2_text": "Image Guy is a free-to-use web tool that allows users to optimize and compress image files. The Service is provided on an \"as-is\" and \"as-available\" basis without any warranties.",
    "terms_section3_title": "3. User Responsibilities",
    "terms_section3_text": "You are solely responsible for the content (images) you upload. You must ensure you have the necessary rights and permissions for any content you process with the Service. You agree not to upload any content that is illegal, harmful, or otherwise objectionable.",
    "terms_section4_title": "4. Intellectual Property",
    "terms_section4_text": "We claim no ownership rights over the images you upload. The intellectual property of your content remains entirely yours. The design, logo, and \"Image Guy\" brand are the property of this website.",
    "terms_section5_title": "5. Disclaimer of Liability",
    "terms_section5_text": "We are not liable for any loss of data or quality degradation that may occur. We reserve the right to block any user from the Service for misuse or abuse.",
    "privacy_title": "Privacy Policy",
    "privacy_last_updated": "Last updated: July 20, 2025",
    "privacy_section1_title": "Image Handling",
    "privacy_section1_text": "Images you upload are sent to our secure cloud servers (Amazon S3 and Netlify Functions) for the sole purpose of optimization. Original and optimized images may be stored temporarily to ensure service delivery and are automatically deleted. We do not access, share, or use your images for any other purpose.",
    "privacy_section2_title": "Information We Collect",
    "privacy_section2_text": "We do not collect any personal information. You are not required to create an account or provide any personal data to use Image Guy. We may use privacy-friendly analytics to monitor website traffic, but this data is anonymized and does not track individual users.",
    "privacy_section3_title": "Third-Party Services",
    "privacy_section3_text": "Our service is built upon professional cloud infrastructure provided by Netlify and Amazon Web Services (AWS). These services have their own robust privacy and security policies.",
    "favicon_post_meta_title": "First of all, what is a favicon?",
    "favicon_post_title": "How to Create a Cute Favicon in Few Simple Steps",
    "favicon_post_excerpt": "Learn how to create an optimized favicon in few simple steps, perfect for your website.",
    "favicon_post_date": "Posted on August 3, 2025",
    "favicon_post_p1": "A favicon is a small “sweet” icon that represents your website. It was used for the first time in 1999, initially in Internet Explorer's bookmark section. Following its standardization in the next decade, it's displayed as of today in browser tabs, bookmark lists, and next to your site's name in search engine results. While contributing to recognition of your brand in great amount, this tiny logo helps users quickly identify your website among many open tabs.",
    "favicon_post_p2": "While favicons can come in various formats, the most common are .png (1996) and .ico (1985). The .ico format is highly compatible and can contain multiple sizes in a single file, while a .png favicon is a modern, high-quality alternative.",
    "favicon_post_p3": "In this brief article, I'll show you how to create a perfect favicon in just a few simple steps using Image Guy.",
    "favicon_post_step1_title": "1. Upload Your Image",
    "favicon_post_step1_text": "Start by uploading your logo or any image you want to convert. The server accepts common formats like JPG, PNG, WebP, AVIF, and HEIC.",
    "favicon_post_step2_title": "2. Choose Your Favicon Format and Click \"Optimize All\"",
    "favicon_post_step2_text": "Select either \"Favicon (PNG)\" or \"Favicon (ICO)\" from the output options. Click the \"Optimize\" button. The process usually takes less than 10 seconds.",
    "favicon_post_toggle_png_title": "Favicon (PNG)",
    "favicon_post_toggle_png_text": "This will create a standard 32x32 pixel PNG icon, perfect for modern browsers.",
    "favicon_post_toggle_ico_title": "Favicon (ICO)",
    "favicon_post_toggle_ico_text": "This option generates a more traditional .ico file that contains multiple resolutions (16x16, 24x24, 32x32, 48x48, and 64x64 pixels) to ensure your icon looks sharp on all platforms.",
    "favicon_post_step3_title": "3. Edit & Download",
    "favicon_post_step3_text": "After optimization is finished, you can also use the \"Edit & Crop\" tool for any final adjustments before downloading. For example, you can crop your image into a circle. When your image is ready, click on \"Download\".",
    "favicon_post_step4_title": "4. Add the Favicon to Your Website",
    "favicon_post_step4_text": "Once downloaded, place the favicon in your website's root directory—root directories are the first places scanned by search engines—and add one of the following code snippets to the <head> section of your HTML. Remember to adjust the \"href\" path if needed.",
    "favicon_post_outro": "Footnote: All these images used in this article are optimized up to 76% and converted to webp format. Enjoy creating your new favicons! Thank you for reading.",
    "editor_title": "Image Editor",
    "zoom": "Zoom",
    "zoom_in": "Zoom In",
    "zoom_out": "Zoom Out",
    "fit_to_screen": "Fit to Screen",
    "tools": "Tools",
    "add_filter": "Add Filter",
    "add_text": "Add Text",
    "add_shape": "Add Shape",
    "actions": "Actions",
    "undo": "Undo",
    "redo": "Redo",
    "cancel": "Cancel",
    "save": "Save"
  },
  "de": {
    "nav_blog": "Blog",
    "nav_about": "Über uns",
    "nav_contact": "Kontakt",
    "footer_privacy": "Datenschutzrichtlinie",
    "footer_terms": "Nutzungsbedingungen",
    "footer_copyright": "© 2025 Image-Guy.com | Alle Rechte vorbehalten.",
    "home_title": "Intelligenter Bildoptimierer",
    "home_subtitle": "Ändern Sie die Größe, komprimieren, konvertieren und beschneiden Sie Ihre Bilder in Sekunden. Kostenlos und sicher.",
    "home_upload_title": "Ziehen Sie Ihre Datei hierher",
    "home_upload_or": "oder",
    "home_upload_button": "Datei auswählen",
    "home_mission_title": "Ein kleiner Fußabdruck, ein Pixel nach dem anderen.",
    "home_mission_text": "Jedes Bild, das Sie optimieren, spart nicht nur Speicherplatz – es spart auch Energie. Weniger Datenübertragung und Speicherung bedeuten einen kleineren digitalen Fußabdruck für einen gesünderen Planeten. Helfen Sie uns, das Web schneller und grüner zu machen.",
    "home_howitworks_title": "Wie es in 5 einfachen Schritten funktioniert",
    "home_howitworks_step1_title": "1. Bild hochladen",
    "home_howitworks_step1_text": "Ziehen Sie Ihre Dateien per Drag & Drop oder klicken Sie auf die Schaltfläche, um sie von Ihrem Gerät auszuwählen.",
    "home_howitworks_step2_title": "2. Einstellungen wählen",
    "home_howitworks_step2_text": "Wählen Sie Ihr gewünschtes Ausgabeformat und passen Sie die Komprimierungsstufe mit dem Qualitätsregler an.",
    "home_howitworks_step3_title": "3. Optimieren",
    "home_howitworks_step3_text": "Unsere Server verarbeiten Ihre Bilder intelligent und finden die perfekte Balance zwischen Größe und Qualität.",
    "home_howitworks_step4_title": "4. Bearbeiten & Überprüfen",
    "home_howitworks_step4_text": "Verwenden Sie die interaktiven Werkzeuge, um das Ergebnis mit dem Original zu vergleichen oder Ihr Bild auf die perfekten Abmessungen zuzuschneiden.",
    "home_howitworks_step5_title": "5. Herunterladen",
    "home_howitworks_step5_text": "Speichern Sie Ihre perfekt optimierten Bilder auf Ihrem Gerät, entweder einzeln oder alle zusammen in einer .ZIP-Datei.",
    "home_announcement": "Welcome.  Herzlich Willkommen.  Hoş geldiniz.  欢迎.  ",
    "quality_label": "Qualität:",
    "contact_title": "Kontaktieren Sie uns",
    "contact_intro": "Wenn Sie Fragen, Feedback oder Vorschläge haben, würden wir uns freuen, von Ihnen zu hören. Der beste Weg, uns zu erreichen, ist per E-Mail.",
    "contact_email_header": "E-Mail",
    "contact_phone_header": "Geschäftstelefon",
    "contact_outro": "Wir werden unser Bestes tun, um uns so schnell wie möglich bei Ihnen zu melden.",
    "about_title": "Über Image Guy",
    "about_mission": "Unsere Mission ist es, ein schnelles, kostenloses und einfach zu bedienendes Werkzeug für jedermann zur Optimierung seiner Bilder für das Web bereitzustellen. Wir glauben an ein schnelleres, effizienteres und grüneres Internet.",
    "about_why_header": "Warum optimieren?",
    "about_why_text": "Jedes Bild, das Sie optimieren, verbessert nicht nur die Ladezeit Ihrer Website, sondern reduziert auch den Energieaufwand für die Datenübertragung und -speicherung. Das bedeutet einen kleineren digitalen Fußabdruck und einen kleinen, aber bedeutenden Beitrag zu einem nachhaltigeren Planeten.",
    "about_tech_header": "Unsere Technologie",
    "about_tech_text": "Image Guy wird von der Hochleistungsbibliothek `sharp` betrieben, die auf einer skalierbaren serverless Architektur läuft. Dies ermöglicht es uns, eine erstklassige Optimierung für verschiedene Formate wie JPEG, PNG, WebP und AVIF ohne Qualitätseinbußen anzubieten.",
    "blog_title": "Image Guy Blog",
    "blog_subtitle": "Tipps, Tricks und Einblicke zur Bildoptimierung und Web-Performance.",
    "blog_post1_title": "Warum ist die Bildoptimierung für Ihre Website wichtig?",
    "blog_post1_excerpt": "Erfahren Sie, warum die Optimierung von Bildern für die Geschwindigkeit der Website, die Nachhaltigkeit und die SEO von entscheidender Bedeutung ist, mit praktischen Tipps für eine bessere Web-Performance.",
    "blog_read_more": "Weiterlesen →",
    "terms_title": "Nutzungsbedingungen",
    "terms_last_updated": "Zuletzt aktualisiert: 20. Juli 2025",
    "terms_section1_title": "1. Annahme der Bedingungen",
    "terms_section1_text": "Durch den Zugriff auf und die Nutzung von Image Guy (\"der Dienst\") akzeptieren Sie die Bedingungen dieser Vereinbarung und erklären sich damit einverstanden, an diese gebunden zu sein.",
    "terms_section2_title": "2. Beschreibung des Dienstes",
    "terms_section2_text": "Image Guy ist ein kostenlos nutzbares Web-Tool, mit dem Benutzer Bilddateien optimieren und komprimieren können. Der Dienst wird auf einer \"as-is\" und \"as-available\" Basis ohne jegliche Gewährleistungen bereitgestellt.",
    "terms_section3_title": "3. Verantwortlichkeiten des Benutzers",
    "terms_section3_text": "Sie sind allein verantwortlich für die von Ihnen hochgeladenen Inhalte (Bilder). Sie müssen sicherstellen, dass Sie die erforderlichen Rechte und Genehmigungen für alle Inhalte besitzen, die Sie mit dem Dienst verarbeiten. Sie stimmen zu, keine illegalen, schädlichen oder anderweitig anstößigen Inhalte hochzuladen.",
    "terms_section4_title": "4. Geistiges Eigentum",
    "terms_section4_text": "Wir erheben keine Eigentumsrechte an den von Ihnen hochgeladenen Bildern. Das geistige Eigentum Ihrer Inhalte verbleibt vollständig bei Ihnen. Das Design, das Logo und die Marke \"Image Guy\" sind Eigentum dieser Website.",
    "terms_section5_title": "5. Haftungsausschluss",
    "terms_section5_text": "Wir haften nicht für Datenverluste oder Qualitätsminderungen, die auftreten können. Wir behalten uns das Recht vor, jeden Benutzer bei Missbrauch oder Missbrauch des Dienstes zu sperren.",
    "privacy_title": "Datenschutzrichtlinie",
    "privacy_last_updated": "Zuletzt aktualisiert: 20. Juli 2025",
    "privacy_section1_title": "Umgang mit Bildern",
    "privacy_section1_text": "Die von Ihnen hochgeladenen Bilder werden ausschließlich zum Zweck der Optimierung an unsere sicheren Cloud-Server (Amazon S3 und Netlify Functions) gesendet. Originale und optimierte Bilder können vorübergehend gespeichert werden, um die Bereitstellung des Dienstes zu gewährleisten, und werden automatisch gelöscht. Wir greifen nicht auf Ihre Bilder zu, teilen sie nicht und verwenden sie nicht für andere Zwecke.",
    "privacy_section2_title": "Informationen, die wir sammeln",
    "privacy_section2_text": "Wir sammeln keine persönlichen Informationen. Sie müssen kein Konto erstellen oder persönliche Daten angeben, um Image Guy zu nutzen. Wir können datenschutzfreundliche Analysen verwenden, um den Website-Traffic zu überwachen, aber diese Daten sind anonymisiert und verfolgen keine einzelnen Benutzer.",
    "privacy_section3_title": "Drittanbieterdienste",
    "privacy_section3_text": "Unser Dienst basiert auf einer professionellen Cloud-Infrastruktur von Netlify und Amazon Web Services (AWS). Diese Dienste haben ihre eigenen robusten Datenschutz- und Sicherheitsrichtlinien.",
    "favicon_post_meta_title": "Zuerst einmal, was ist ein Favicon?",
    "favicon_post_title": "Wie man in wenigen einfachen Schritten ein süßes Favicon erstellt",
    "favicon_post_excerpt": "Lernen Sie, wie Sie in wenigen einfachen Schritten ein optimiertes Favicon erstellen, das perfekt für Ihre Website ist.",
    "favicon_post_date": "Veröffentlicht am 3. August 2025",
    "favicon_post_p1": "Ein Favicon ist ein kleines, „süßes“ Symbol, das Ihre Website repräsentiert. Es wurde erstmals 1999 verwendet, anfangs im Lesezeichenbereich des Internet Explorers. Nach seiner Standardisierung im nächsten Jahrzehnt wird es heute in Browser-Tabs, Lesezeichenlisten und neben dem Namen Ihrer Website in den Suchmaschinenergebnissen angezeigt. Es trägt erheblich zur Wiedererkennung Ihrer Marke bei und hilft den Benutzern, Ihre Website schnell unter vielen offenen Tabs zu identifizieren.",
    "favicon_post_p2": "Obwohl Favicons in verschiedenen Formaten vorliegen können, sind die gebräuchlichsten .png (1996) und .ico (1985). Das .ico-Format ist sehr kompatibel und kann mehrere Größen in einer einzigen Datei enthalten, während ein .png-Favicon eine moderne, hochwertige Alternative ist.",
    "favicon_post_p3": "In diesem kurzen Artikel zeige ich Ihnen, wie Sie mit Image Guy in nur wenigen einfachen Schritten ein perfektes Favicon erstellen.",
    "favicon_post_step1_title": "1. Bild hochladen",
    "favicon_post_step1_text": "Laden Sie zunächst Ihr Logo oder ein beliebiges Bild hoch, das Sie konvertieren möchten. Der Server akzeptiert gängige Formate wie JPG, PNG, WebP, AVIF und HEIC.",
    "favicon_post_step2_title": "2. Favicon-Format auswählen und auf „Alle optimieren“ klicken",
    "favicon_post_step2_text": "Wählen Sie entweder „Favicon (PNG)“ oder „Favicon (ICO)“ aus den Ausgabeoptionen. Klicken Sie auf die Schaltfläche „Optimieren“. Der Vorgang dauert in der Regel weniger als 10 Sekunden.",
    "favicon_post_toggle_png_title": "Favicon (PNG)",
    "favicon_post_toggle_png_text": "Dadurch wird ein standardmäßiges 32x32-Pixel-PNG-Symbol erstellt, das sich perfekt für moderne Browser eignet.",
    "favicon_post_toggle_ico_title": "Favicon (ICO)",
    "favicon_post_toggle_ico_text": "Diese Option generiert eine traditionellere .ico-Datei, die mehrere Auflösungen (16x16, 24x24, 32x32, 48x48 und 64x64 Pixel) enthält, um sicherzustellen, dass Ihr Symbol auf allen Plattformen scharf aussieht.",
    "favicon_post_step3_title": "3. Bearbeiten & Herunterladen",
    "favicon_post_step3_text": "Nach Abschluss der Optimierung können Sie auch das Werkzeug „Bearbeiten & Zuschneiden“ für letzte Anpassungen vor dem Herunterladen verwenden. Sie können Ihr Bild beispielsweise in einen Kreis zuschneiden. Wenn Ihr Bild fertig ist, klicken Sie auf „Herunterladen“.",
    "favicon_post_step4_title": "4. Favicon zu Ihrer Website hinzufügen",
    "favicon_post_step4_text": "Legen Sie das Favicon nach dem Herunterladen im Stammverzeichnis Ihrer Website ab – Stammverzeichnisse werden von Suchmaschinen zuerst gescannt – und fügen Sie einen der folgenden Codeausschnitte in den <head>-Abschnitt Ihres HTML ein. Denken Sie daran, den „href“-Pfad bei Bedarf anzupassen.",
    "favicon_post_outro": "Fußnote: Alle in diesem Artikel verwendeten Bilder sind bis zu 76 % optimiert und in das WebP-Format konvertiert. Viel Spaß beim Erstellen Ihrer neuen Favicons! Danke fürs Lesen.",
    "editor_title": "Bildbearbeitung",
    "zoom": "Zoomen",
    "zoom_in": "Vergrößern",
    "zoom_out": "Verkleinern",
    "fit_to_screen": "An Bildschirm anpassen",
    "tools": "Werkzeuge",
    "add_filter": "Filter hinzufügen",
    "add_text": "Text hinzufügen",
    "add_shape": "Form hinzufügen",
    "actions": "Aktionen",
    "undo": "Rückgängig",
    "redo": "Wiederholen",
    "cancel": "Abbrechen",
    "save": "Speichern"
  },
  "zh": {
    "nav_blog": "博客",
    "nav_about": "关于",
    "nav_contact": "联系",
    "footer_privacy": "隐私政策",
    "footer_terms": "服务条款",
    "footer_copyright": "© 2025 Image-Guy.com | 版权所有。",
    "home_title": "智能图像优化与编辑器",
    "home_subtitle": "在几秒钟内即时调整、压缩、转换和裁剪您的图像。免费且安全。",
    "home_upload_title": "将您的文件拖放到此处",
    "home_upload_or": "或",
    "home_upload_button": "选择文件",
    "home_mission_title": "一小步，一像素。",
    "home_mission_text": "您优化的每一张图片不仅节省空间，还节省能源。更少的数据传输和存储意味着更小的数字足迹，为一个更健康的地球做出贡献。加入我们，让网络更快、更环保。",
    "home_howitworks_title": "操作流程：5个简单步骤",
    "home_howitworks_step1_title": "1. 上传图像",
    "home_howitworks_step1_text": "拖放您的文件或点击按钮从您的设备中选择它们。",
    "home_howitworks_step2_title": "2. 选择设置",
    "home_howitworks_step2_text": "选择您想要的输出格式，并使用质量滑块调整压缩级别。",
    "home_howitworks_step3_title": "3. 优化",
    "home_howitworks_step3_text": "我们的服务器会智能处理您的图像，在尺寸和质量之间找到完美的平衡。",
    "home_howitworks_step4_title": "4. 编辑与审查",
    "home_howitworks_step4_text": "使用交互式工具将结果与原始图像进行比较，或将您的图像裁剪至完美尺寸。",
    "home_howitworks_step5_title": "5. 下载",
    "home_howitworks_step5_text": "将您完美优化的图像保存到您的设备上，可以逐个下载，也可以将所有图像一起下载到一个.ZIP文件中。",
    "home_announcement": "Welcome.  Herzlich Willkommen.  Hoş geldiniz.  欢迎.  ",
    "quality_label": "质量:",
    "contact_title": "联系我们",
    "contact_intro": "如果您有任何问题、反馈或建议，我们很乐意听取。联系我们的最佳方式是通过电子邮件。",
    "contact_email_header": "电子邮件",
    "contact_phone_header": "商务电话",
    "contact_outro": "我们会尽力尽快给您回复。",
    "about_title": "关于 Image Guy",
    "about_mission": "我们的使命是为每个人提供一个快速、免费且易于使用的工具来优化他们的网络图像。我们相信一个更快、更高效、更环保的互联网。",
    "about_why_header": "为什么要优化？",
    "about_why_text": "您优化的每一张图片不仅能提高您网站的加载速度，还能减少数据传输和存储所需的能源。这意味着更小的数字足迹，为更可持续的地球做出虽小但有意义的贡献。",
    "about_tech_header": "我们的技术",
    "about_tech_text": "Image Guy 由高性能的 `sharp` 库驱动，运行在可扩展的无服务器架构上。这使我们能够为JPEG、PNG、WebP和AVIF等各种格式提供顶级的优化，而不会影响质量。",
    "blog_title": "Image Guy 博客",
    "blog_subtitle": "关于图像优化和网络性能的提示、技巧和见解。",
    "blog_post1_title": "为什么图像优化对您的网站很重要？",
    "blog_post1_excerpt": "了解为什么优化图像对网站速度、可持续性和SEO至关重要，并提供改善网络性能的实用技巧。",
    "blog_read_more": "阅读更多 →",
    "terms_title": "服务条款",
    "terms_last_updated": "最后更新：2025年7月20日",
    "terms_section1_title": "1. 接受条款",
    "terms_section1_text": "通过访问和使用 Image Guy（“本服务”），您接受并同意受本协议的条款和规定约束。",
    "terms_section2_title": "2. 服务描述",
    "terms_section2_text": "Image Guy 是一个免费使用的网络工具，允许用户优化和压缩图像文件。本服务按“原样”和“现有”基础提供，不作任何保证。",
    "terms_section3_title": "3. 用户责任",
    "terms_section3_text": "您对上传的内容（图像）负全部责任。您必须确保您拥有处理通过本服务处理的任何内容的必要权利和许可。您同意不上传任何非法、有害或其他令人反感的内容。",
    "terms_section4_title": "4. 知识产权",
    "terms_section4_text": "我们对您上传的图像不主张任何所有权。您内容的知识产权完全属于您。本网站的设计、标志和“Image Guy”品牌是本网站的财产。",
    "terms_section5_title": "5. 免责声明",
    "terms_section5_text": "我们对可能发生的任何数据丢失或质量下降概不负责。我们保留因滥用或滥用服务而阻止任何用户使用本服务的权利。",
    "privacy_title": "隐私政策",
    "privacy_last_updated": "最后更新：2025年7月20日",
    "privacy_section1_title": "图像处理",
    "privacy_section1_text": "您上传的图像被发送到我们的安全云服务器（Amazon S3 和 Netlify Functions），其唯一目的是进行优化。原始和优化后的图像可能会被临时存储以确保服务交付，并会自动删除。我们不会出于任何其他目的访问、共享或使用您的图像。",
    "privacy_section2_title": "我们收集的信息",
    "privacy_section2_text": "我们不收集任何个人信息。您无需创建帐户或提供任何个人数据即可使用 Image Guy。我们可能会使用注重隐私的分析来监控网站流量，但这些数据是匿名的，不会跟踪个人用户。",
    "privacy_section3_title": "第三方服务",
    "privacy_section3_text": "我们的服务建立在由 Netlify 和 Amazon Web Services (AWS) 提供的专业云基础设施之上。这些服务拥有自己强大的隐私和安全政策。",
    "favicon_post_meta_title": "首先，什么是网站图标？",
    "favicon_post_title": "如何通过几个简单步骤创建一个可爱的网站图标",
    "favicon_post_excerpt": "了解如何通过几个简单的步骤创建一个完美的网站图标，非常适合您的网站。",
    "favicon_post_date": "发布于2025年8月3日",
    "favicon_post_p1": "网站图标（favicon）是代表您网站的一个小巧可爱的图标。它于1999年首次使用，最初出现在Internet Explorer的书签部分。在接下来的十年中标准化后，如今它显示在浏览器标签页、书签列表以及搜索引擎结果中您网站名称的旁边。它极大地有助于提高您的品牌辨识度，并帮助用户在众多打开的标签页中快速识别您的网站。",
    "favicon_post_p2": "虽然网站图标有多种格式，但最常见的是.png（1996年）和.ico（1985年）。.ico格式兼容性强，可以在单个文件中包含多种尺寸，而.png网站图标则是一种现代、高质量的替代方案。",
    "favicon_post_p3": "在这篇简短的文章中，我将向您展示如何使用Image Guy通过几个简单的步骤创建一个完美的网站图标。",
    "favicon_post_step1_title": "1. 上传您的图片",
    "favicon_post_step1_text": "首先上传您想要转换的徽标或任何图片。服务器接受JPG、PNG、WebP、AVIF和HEIC等常见格式。",
    "favicon_post_step2_title": "2. 选择您的网站图标格式并点击“全部优化”",
    "favicon_post_step2_text": "从输出选项中选择“Favicon (PNG)”或“Favicon (ICO)”。点击“优化”按钮。此过程通常不到10秒钟。",
    "favicon_post_toggle_png_title": "网站图标 (PNG)",
    "favicon_post_toggle_png_text": "这将创建一个标准的32x32像素PNG图标，非常适合现代浏览器。",
    "favicon_post_toggle_ico_title": "网站图标 (ICO)",
    "favicon_post_toggle_ico_text": "此选项会生成一个更传统的.ico文件，其中包含多种分辨率（16x16、24x24、32x32、48x48和64x64像素），以确保您的图标在所有平台上都看起来清晰。",
    "favicon_post_step3_title": "3. 编辑和下载",
    "favicon_post_step3_text": "优化完成后，您还可以使用“编辑和裁剪”工具在下载前进行任何最终调整。例如，您可以将图像裁剪成圆形。当您的图像准备好后，点击“下载”。",
    "favicon_post_step4_title": "4. 将网站图标添加到您的网站",
    "favicon_post_step4_text": "下载后，将网站图标放置在您网站的根目录中——根目录是搜索引擎首先扫描的地方——并将以下代码片段之一添加到您HTML的<head>部分。如果需要，请记得调整“href”路径。",
    "favicon_post_outro": "附注：本文中使用的所有这些图像都经过高达76%的优化，并转换为webp格式。祝您创建新的网站图标愉快！感谢您的阅读。",
    "editor_title": "图像编辑器",
    "zoom": "缩放",
    "zoom_in": "放大",
    "zoom_out": "缩小",
    "fit_to_screen": "适应屏幕",
    "tools": "工具",
    "add_filter": "添加滤镜",
    "add_text": "添加文本",
    "add_shape": "添加形状",
    "actions": "操作",
    "undo": "撤销",
    "redo": "重做",
    "cancel": "取消",
    "save": "保存"
  },
  "tr": {
    "nav_blog": "Blog",
    "nav_about": "Hakkında",
    "nav_contact": "İletişim",
    "footer_privacy": "Gizlilik Politikası",
    "footer_terms": "Hizmet Şartları",
    "footer_copyright": "© 2025 Image-Guy.com | Tüm Hakları Saklıdır.",
    "home_title": "Akıllı Resim Optimizasyonu",
    "home_subtitle": "Görüntülerinizi saniyeler içinde anında yeniden boyutlandırın, sıkıştırın, dönüştürün ve kırpın. Ücretsiz ve güvenli.",
    "home_upload_title": "Dosyanızı Buraya Sürükleyip Bırakın",
    "home_upload_or": "veya",
    "home_upload_button": "Dosya Seç",
    "home_mission_title": "Her Pikselde Daha Küçük Bir Ayak İzi.",
    "home_mission_text": "Optimize ettiğiniz her görüntü sadece yerden tasarruf etmez, aynı zamanda enerji de tasarrufu sağlar. Daha az veri transferi ve depolama, daha sağlıklı bir gezegen için daha küçük bir dijital ayak izi anlamına gelir. Web'i daha hızlı ve daha yeşil hale getirmemize katılın.",
    "home_howitworks_title": "5 Basit Adımda Nasıl Çalışır?",
    "home_howitworks_step1_title": "1. Resim Yükle",
    "home_howitworks_step1_text": "Dosyalarınızı sürükleyip bırakın veya butona tıklayarak cihazınızdan seçin.",
    "home_howitworks_step2_title": "2. Ayarları Seç",
    "home_howitworks_step2_text": "İstediğiniz çıktı formatını seçin ve kalite kaydırıcısı ile sıkıştırma seviyesini ayarlayın.",
    "home_howitworks_step3_title": "3. Optimize Et",
    "home_howitworks_step3_text": "Sunucularımız, boyut ve kalite arasında mükemmel dengeyi bularak resimlerinizi akıllıca işler.",
    "home_howitworks_step4_title": "4. Düzenle ve İncele",
    "home_howitworks_step4_text": "Sonucu orijinaliyle karşılaştırmak veya resminizi mükemmel boyutlarda kırpmak için interaktif araçları kullanın.",
    "home_howitworks_step5_title": "5. İndir",
    "home_howitworks_step5_text": "Mükemmel şekilde optimize edilmiş resimlerinizi cihazınıza tek tek veya hepsini bir .ZIP dosyası içinde kaydedin.",
    "home_announcement": "Welcome.  Herzlich Willkommen.  Hoş geldiniz.  欢迎.  ",
    "quality_label": "Kalite:",
    "contact_title": "Bize Ulaşın",
    "contact_intro": "Herhangi bir sorunuz, geri bildiriminiz veya öneriniz varsa, sizden haber almak isteriz. Bize ulaşmanın en iyi yolu e-postadır.",
    "contact_email_header": "E-posta",
    "contact_phone_header": "İş Telefonu",
    "contact_outro": "Size en kısa sürede geri dönmek için elimizden geleni yapacağız.",
    "about_title": "Image Guy Hakkında",
    "about_mission": "Misyonumuz, herkesin web için görüntülerini optimize edebileceği hızlı, ücretsiz ve kullanımı kolay bir araç sağlamaktır. Daha hızlı, daha verimli ve daha yeşil bir internete inanıyoruz.",
    "about_why_header": "Neden Optimizasyon?",
    "about_why_text": "Optimize ettiğiniz her görüntü sadece web sitenizin yükleme hızını artırmakla kalmaz, aynı zamanda veri transferi ve depolama için gereken enerjiyi de azaltır. Bu, daha küçük bir dijital ayak izi ve daha sürdürülebilir bir gezegene küçük ama anlamlı bir katkı anlamına gelir.",
    "about_tech_header": "Teknolojimiz",
    "about_tech_text": "Image Guy, ölçeklenebilir bir sunucusuz mimari üzerinde çalışan yüksek performanslı `sharp` kütüphanesi tarafından desteklenmektedir. Bu, kaliteden ödün vermeden JPEG, PNG, WebP ve AVIF gibi çeşitli formatlar için üst düzey optimizasyon sunmamızı sağlar.",
    "blog_title": "Image Guy Blogu",
    "blog_subtitle": "Görüntü optimizasyonu ve web performansı üzerine ipuçları ve bilgiler.",
    "blog_post1_title": "Resim Optimizasyonu SEO'nuzu Nasıl Güçlendirir ve Gezegeni Korur?",
    "blog_post1_excerpt": "Daha iyi web performansı için pratik ipuçlarıyla, görüntüleri optimize etmenin site hızı, sürdürülebilirlik ve SEO için neden kritik olduğunu öğrenin.",
    "blog_read_more": "Devamını Oku →",
    "terms_title": "Hizmet Şartları",
    "terms_last_updated": "Son güncelleme: 20 Temmuz 2025",
    "terms_section1_title": "1. Şartların Kabulü",
    "terms_section1_text": "Image Guy'a (\"Hizmet\") erişerek ve kullanarak, bu sözleşmenin şartlarını ve hükümlerini kabul etmiş ve bunlara bağlı kalmayı kabul etmiş olursunuz.",
    "terms_section2_title": "2. Hizmetin Tanımı",
    "terms_section2_text": "Image Guy, kullanıcıların görüntü dosyalarını optimize etmesine ve sıkıştırmasına olanak tanıyan ücretsiz bir web aracıdır. Hizmet, herhangi bir garanti olmaksızın \"olduğu gibi\" ve \"mevcut olduğu gibi\" esasına göre sağlanır.",
    "terms_section3_title": "3. Kullanıcı Sorumlulukları",
    "terms_section3_text": "Yüklediğiniz içerikten (görüntülerden) yalnızca siz sorumlusunuz. Hizmet ile işlediğiniz herhangi bir içerik için gerekli haklara ve izinlere sahip olduğunuzdan emin olmalısınız. Yasa dışı, zararlı veya başka şekilde sakıncalı herhangi bir içerik yüklememeyi kabul edersiniz.",
    "terms_section4_title": "4. Fikri Mülkiyet",
    "terms_section4_text": "Yüklediğiniz görüntüler üzerinde herhangi bir mülkiyet hakkı iddia etmiyoruz. İçeriğinizin fikri mülkiyeti tamamen size aittir. Tasarım, logo ve \"Image Guy\" markası bu web sitesinin mülkiyetindedir.",
    "terms_section5_title": "5. Sorumluluğun Reddi",
    "terms_section5_text": "Meydana gelebilecek herhangi bir veri kaybından veya kalite düşüşünden sorumlu değiliz. Kötüye kullanım veya suistimal durumunda herhangi bir kullanıcıyı Hizmetten engelleme hakkını saklı tutarız.",
    "privacy_title": "Gizlilik Politikası",
    "privacy_last_updated": "Son güncelleme: 20 Temmuz 2025",
    "privacy_section1_title": "Görüntü Yönetimi",
    "privacy_section1_text": "Yüklediğiniz görüntüler, yalnızca optimizasyon amacıyla güvenli bulut sunucularımıza (Amazon S3 ve Netlify Functions) gönderilir. Orijinal ve optimize edilmiş görüntüler, hizmet sunumunu sağlamak için geçici olarak saklanabilir ve otomatik olarak silinir. Görüntülerinize başka hiçbir amaçla erişmiyor, paylaşmıyor veya kullanmıyoruz.",
    "privacy_section2_title": "Topladığımız Bilgiler",
    "privacy_section2_text": "Herhangi bir kişisel bilgi toplamıyoruz. Image Guy'ı kullanmak için bir hesap oluşturmanız veya herhangi bir kişisel veri sağlamanız gerekmez. Web sitesi trafiğini izlemek için gizlilik dostu analizler kullanabiliriz, ancak bu veriler anonimleştirilmiştir ve bireysel kullanıcıları izlemez.",
    "privacy_section3_title": "Üçüncü Taraf Hizmetleri",
    "privacy_section3_text": "Hizmetimiz, Netlify ve Amazon Web Services (AWS) tarafından sağlanan profesyonel bulut altyapısı üzerine kuruludur. Bu hizmetlerin kendi sağlam gizlilik ve güvenlik politikaları vardır.",
    "favicon_post_meta_title": "Öncelikle, favicon nedir?",
    "favicon_post_title": "Birkaç Basit Adımda Sevimli Bir Favicon Nasıl Oluşturulur",
    "favicon_post_excerpt": "Web siteniz için mükemmel, optimize edilmiş bir favicon'u birkaç basit adımda nasıl oluşturacağınızı öğrenin.",
    "favicon_post_date": "Yayınlanma tarihi: 3 Ağustos 2025",
    "favicon_post_p1": "Favicon, web sitenizi temsil eden küçük, “sevimli” bir ikondur. İlk olarak 1999'da, Internet Explorer'ın yer imleri bölümünde kullanılmıştır. Sonraki on yılda standartlaşmasının ardından, bugün tarayıcı sekmelerinde, yer imi listelerinde ve arama motoru sonuçlarında site adınızın yanında görüntülenir. Markanızın tanınırlığına büyük katkı sağlarken, bu minik logo kullanıcıların birçok açık sekme arasında web sitenizi hızla tanımasına yardımcı olur.",
    "favicon_post_p2": "Favicon'lar çeşitli formatlarda olabilse de, en yaygın olanları .png (1996) ve .ico (1985) formatlarıdır. .ico formatı yüksek uyumluluğa sahiptir ve tek bir dosyada birden çok boyut içerebilirken, .png formatındaki bir favicon modern ve yüksek kaliteli bir alternatiftir.",
    "favicon_post_p3": "Bu kısa makalede, Image Guy'ı kullanarak sadece birkaç basit adımda mükemmel bir favicon'u nasıl oluşturacağınızı göstereceğim.",
    "favicon_post_step1_title": "1. Resminizi Yükleyin",
    "favicon_post_step1_text": "Logonuzu veya dönüştürmek istediğiniz herhangi bir resmi yükleyerek başlayın. Sunucu, JPG, PNG, WebP, AVIF ve HEIC gibi yaygın formatları kabul eder.",
    "favicon_post_step2_title": "2. Favicon Formatınızı Seçin ve \"Tümünü Optimize Et\"e Tıklayın",
    "favicon_post_step2_text": "Çıktı seçeneklerinden \"Favicon (PNG)\" veya \"Favicon (ICO)\" seçeneğini belirleyin. \"Optimize Et\" butonuna tıklayın. İşlem genellikle 10 saniyeden az sürer.",
    "favicon_post_toggle_png_title": "Favicon (PNG)",
    "favicon_post_toggle_png_text": "Bu, modern tarayıcılar için mükemmel olan standart bir 32x32 piksel PNG ikonu oluşturacaktır.",
    "favicon_post_toggle_ico_title": "Favicon (ICO)",
    "favicon_post_toggle_ico_text": "Bu seçenek, ikonunuzun tüm platformlarda keskin görünmesini sağlamak için birden çok çözünürlük (16x16, 24x24, 32x32, 48x48 ve 64x64 piksel) içeren daha geleneksel bir .ico dosyası oluşturur.",
    "favicon_post_step3_title": "3. Düzenle ve İndir",
    "favicon_post_step3_text": "Optimizasyon bittikten sonra, indirmeden önce son ayarlamalar için \"Düzenle ve Kırp\" aracını da kullanabilirsiniz. Örneğin, resminizi bir daire şeklinde kırpabilirsiniz. Resminiz hazır olduğunda \"İndir\"e tıklayın.",
    "favicon_post_step4_title": "4. Favicon'u Web Sitenize Ekleyin",
    "favicon_post_step4_text": "İndirdikten sonra, favicon'u web sitenizin kök dizinine yerleştirin – kök dizinler arama motorları tarafından ilk taranan yerlerdir – ve aşağıdaki kod parçacıklarından birini HTML'inizin <head> bölümüne ekleyin. Gerekirse \"href\" yolunu ayarlamayı unutmayın.",
    "favicon_post_outro": "Not: Bu makalede kullanılan tüm resimler %76'ya varan oranlarda optimize edilmiş ve webp formatına dönüştürülmüştür. Yeni favicon'larınızı oluşturmanın tadını çıkarın! Okuduğunuz için teşekkürler.",
    "editor_title": "Resim Düzenleyici",
    "zoom": "Yakınlaştırma",
    "zoom_in": "Yakınlaştır",
    "zoom_out": "Uzaklaştır",
    "fit_to_screen": "Ekrana Sığdır",
    "tools": "Araçlar",
    "add_filter": "Filtre Ekle",
    "add_text": "Metin Ekle",
    "add_shape": "Şekil Ekle",
    "actions": "Eylemler",
    "undo": "Geri Al",
    "redo": "İleri Al",
    "cancel": "İptal",
    "save": "Kaydet"
  }
}