{
  "en": {
    "nav_blog": "Blog",
    "nav_about": "About",
    "nav_contact": "Contact",
    "footer_privacy": "Privacy Policy",
    "footer_terms": "Terms of Service",
    "footer_copyright": "&copy; 2025 Image-Guy.com | All Rights Reserved.",
    "home_title": "Smart Image Optimizer & Editor",
    "home_subtitle": "Instantly resize, compress, convert, and crop your images in seconds. Free and secure.",
    "home_upload_title": "Drag & Drop Your File Here",
    "home_upload_or": "or",
    "home_upload_button": "Choose File",
    "home_mission_title": "A Small Footprint, One Pixel at a Time.",
    "home_mission_text": "Every image you optimize doesn't just save space—it saves energy. Less data transfer and storage mean a smaller digital footprint for a healthier planet. Join us in making the web faster and greener.",
    "home_howitworks_title": "How It Works in 3 Simple Steps",
    "home_howitworks_step1_title": "1. Upload",
    "home_howitworks_step1_text": "Drag & drop or choose your image. Select the output format and adjust the quality to your liking, if needed. Make sure you have an internet connection.",
    "home_howitworks_step2_title": "2. Optimize",
    "home_howitworks_step2_text": "Our servers intelligently optimize your image, finding the perfect balance between the smallest file size and the best quality.",
    "home_howitworks_step3_title": "3. Edit & Download",
    "home_howitworks_step3_text": "Crop, compare, and download your new, perfectly-sized image as a single file or a convenient .ZIP archive.",
    "home_announcement": "Dear user, the compare function after cropping is being improved. Feel Free to Reach Me Out for Your Feedback!",
    "contact_title": "Contact Us",
    "contact_intro": "If you have any questions, feedback, or suggestions, we'd love to hear from you. The best way to reach us is by email.",
    "contact_email_header": "Email",
    "contact_phone_header": "Business Phone",
    "contact_outro": "We'll do our best to get back to you as soon as possible.",
    "about_title": "About Image Guy",
    "about_mission": "Our mission is to provide a fast, free, and easy-to-use tool for everyone to optimize their images for the web. We believe in a faster, more efficient, and greener internet.",
    "about_why_header": "Why Optimize?",
    "about_why_text": "Every image you optimize doesn't just improve your website's loading speed; it also reduces the energy required for data transfer and storage. This means a smaller digital footprint and a small but meaningful contribution to a more sustainable planet.",
    "about_tech_header": "Our Technology",
    "about_tech_text": "Image Guy is powered by the high-performance `sharp` library, running on a scalable serverless architecture. This allows us to offer top-tier optimization for various formats like JPEG, PNG, WebP, and AVIF without compromising on quality.",
    "blog_title": "Image Guy Blog",
    "blog_subtitle": "Tips, tricks, and insights on image optimization and web performance.",
    "blog_post1_title": "Why is Image Optimization Important for Your Website?",
    "blog_post1_excerpt": "Learn why optimizing images is critical for site speed, sustainability, and SEO, with practical tips for better web performance.",
    "blog_read_more": "Read More &rarr;",
    "terms_title": "Terms of Service",
    "terms_last_updated": "Last updated: July 20, 2025",
    "terms_section1_title": "1. Acceptance of Terms",
    "terms_section1_text": "By accessing and using Image Guy (\"the Service\"), you accept and agree to be bound by the terms and provisions of this agreement.",
    "terms_section2_title": "2. Description of Service",
    "terms_section2_text": "Image Guy is a free-to-use web tool that allows users to optimize and compress image files. The Service is provided on an \"as-is\" and \"as-available\" basis without any warranties.",
    "terms_section3_title": "3. User Responsibilities",
    "terms_section3_text": "You are solely responsible for the content (images) you upload. You must ensure you have the necessary rights and permissions for any content you process with the Service. You agree not to upload any content that is illegal, harmful, or otherwise objectionable.",
    "terms_section4_title": "4. Intellectual Property",
    "terms_section4_text": "We claim no ownership rights over the images you upload. The intellectual property of your content remains entirely yours. The design, logo, and \"Image Guy\" brand are the property of this website.",
    "terms_section5_title": "5. Disclaimer of Liability",
    "terms_section5_text": "We are not liable for any loss of data or quality degradation that may occur. We reserve the right to block any user from the Service for misuse or abuse.",
    "privacy_title": "Privacy Policy",
    "privacy_last_updated": "Last updated: July 20, 2025",
    "privacy_section1_title": "Image Handling",
    "privacy_section1_text": "Images you upload are sent to our secure cloud servers (Amazon S3 and Netlify Functions) for the sole purpose of optimization. Original and optimized images may be stored temporarily to ensure service delivery and are automatically deleted. We do not access, share, or use your images for any other purpose.",
    "privacy_section2_title": "Information We Collect",
    "privacy_section2_text": "We do not collect any personal information. You are not required to create an account or provide any personal data to use Image Guy. We may use privacy-friendly analytics to monitor website traffic, but this data is anonymized and does not track individual users.",
    "privacy_section3_title": "Third-Party Services",
    "privacy_section3_text": "Our service is built upon professional cloud infrastructure provided by Netlify and Amazon Web Services (AWS). These services have their own robust privacy and security policies."
  },
  "de": {
    "nav_blog": "Blog",
    "nav_about": "Über uns",
    "nav_contact": "Kontakt",
    "footer_privacy": "Datenschutzrichtlinie",
    "footer_terms": "Nutzungsbedingungen",
    "footer_copyright": "&copy; 2025 Image-Guy.com | Alle Rechte vorbehalten.",
    "home_title": "Intelligenter Bildoptimierer & Editor",
    "home_subtitle": "Ändern Sie die Größe, komprimieren, konvertieren und beschneiden Sie Ihre Bilder in Sekunden. Kostenlos und sicher.",
    "home_upload_title": "Ziehen Sie Ihre Datei hierher",
    "home_upload_or": "oder",
    "home_upload_button": "Datei auswählen",
    "home_mission_title": "Ein kleiner Fußabdruck, ein Pixel nach dem anderen.",
    "home_mission_text": "Jedes Bild, das Sie optimieren, spart nicht nur Speicherplatz – es spart auch Energie. Weniger Datenübertragung und Speicherung bedeuten einen kleineren digitalen Fußabdruck für einen gesünderen Planeten. Helfen Sie uns, das Web schneller und grüner zu machen.",
    "home_howitworks_title": "Wie es in 3 einfachen Schritten funktioniert",
    "home_howitworks_step1_title": "1. Hochladen",
    "home_howitworks_step1_text": "Ziehen Sie Ihr Bild per Drag & Drop oder wählen Sie es aus. Wählen Sie das Ausgabeformat und passen Sie bei Bedarf die Qualität an. Stellen Sie sicher, dass Sie eine Internetverbindung haben.",
    "home_howitworks_step2_title": "2. Optimieren",
    "home_howitworks_step2_text": "Unsere Server optimieren Ihr Bild intelligent und finden die perfekte Balance zwischen der kleinsten Dateigröße und der besten Qualität.",
    "home_howitworks_step3_title": "3. Bearbeiten & Herunterladen",
    "home_howitworks_step3_text": "Beschneiden, vergleichen und laden Sie Ihr neues, perfekt dimensioniertes Bild als einzelne Datei oder als praktisches .ZIP-Archiv herunter.",
    "home_announcement": "Lieber Benutzer, die Vergleichsfunktion nach dem Zuschneiden wird verbessert. Zögern Sie nicht, mir für Ihr Feedback zu schreiben!",
    "contact_title": "Kontaktieren Sie uns",
    "contact_intro": "Wenn Sie Fragen, Feedback oder Vorschläge haben, würden wir uns freuen, von Ihnen zu hören. Der beste Weg, uns zu erreichen, ist per E-Mail.",
    "contact_email_header": "E-Mail",
    "contact_phone_header": "Geschäftstelefon",
    "contact_outro": "Wir werden unser Bestes tun, um uns so schnell wie möglich bei Ihnen zu melden.",
    "about_title": "Über Image Guy",
    "about_mission": "Unsere Mission ist es, ein schnelles, kostenloses und einfach zu bedienendes Werkzeug für jedermann zur Optimierung seiner Bilder für das Web bereitzustellen. Wir glauben an ein schnelleres, effizienteres und grüneres Internet.",
    "about_why_header": "Warum optimieren?",
    "about_why_text": "Jedes Bild, das Sie optimieren, verbessert nicht nur die Ladezeit Ihrer Website, sondern reduziert auch den Energieaufwand für die Datenübertragung und -speicherung. Das bedeutet einen kleineren digitalen Fußabdruck und einen kleinen, aber bedeutenden Beitrag zu einem nachhaltigeren Planeten.",
    "about_tech_header": "Unsere Technologie",
    "about_tech_text": "Image Guy wird von der Hochleistungsbibliothek `sharp` betrieben, die auf einer skalierbaren serverless Architektur läuft. Dies ermöglicht es uns, eine erstklassige Optimierung für verschiedene Formate wie JPEG, PNG, WebP und AVIF ohne Qualitätseinbußen anzubieten.",
    "blog_title": "Image Guy Blog",
    "blog_subtitle": "Tipps, Tricks und Einblicke zur Bildoptimierung und Web-Performance.",
    "blog_post1_title": "Warum ist die Bildoptimierung für Ihre Website wichtig?",
    "blog_post1_excerpt": "Erfahren Sie, warum die Optimierung von Bildern für die Geschwindigkeit der Website, die Nachhaltigkeit und die SEO von entscheidender Bedeutung ist, mit praktischen Tipps für eine bessere Web-Performance.",
    "blog_read_more": "Weiterlesen &rarr;",
    "terms_title": "Nutzungsbedingungen",
    "terms_last_updated": "Zuletzt aktualisiert: 20. Juli 2025",
    "terms_section1_title": "1. Annahme der Bedingungen",
    "terms_section1_text": "Durch den Zugriff auf und die Nutzung von Image Guy (\"der Dienst\") akzeptieren Sie die Bedingungen dieser Vereinbarung und erklären sich damit einverstanden, an diese gebunden zu sein.",
    "terms_section2_title": "2. Beschreibung des Dienstes",
    "terms_section2_text": "Image Guy ist ein kostenlos nutzbares Web-Tool, mit dem Benutzer Bilddateien optimieren und komprimieren können. Der Dienst wird auf einer \"as-is\" und \"as-available\" Basis ohne jegliche Gewährleistungen bereitgestellt.",
    "terms_section3_title": "3. Verantwortlichkeiten des Benutzers",
    "terms_section3_text": "Sie sind allein verantwortlich für die von Ihnen hochgeladenen Inhalte (Bilder). Sie müssen sicherstellen, dass Sie die erforderlichen Rechte und Genehmigungen für alle Inhalte besitzen, die Sie mit dem Dienst verarbeiten. Sie stimmen zu, keine illegalen, schädlichen oder anderweitig anstößigen Inhalte hochzuladen.",
    "terms_section4_title": "4. Geistiges Eigentum",
    "terms_section4_text": "Wir erheben keine Eigentumsrechte an den von Ihnen hochgeladenen Bildern. Das geistige Eigentum Ihrer Inhalte verbleibt vollständig bei Ihnen. Das Design, das Logo und die Marke \"Image Guy\" sind Eigentum dieser Website.",
    "terms_section5_title": "5. Haftungsausschluss",
    "terms_section5_text": "Wir haften nicht für Datenverluste oder Qualitätsminderungen, die auftreten können. Wir behalten uns das Recht vor, jeden Benutzer bei Missbrauch oder Missbrauch des Dienstes zu sperren.",
    "privacy_title": "Datenschutzrichtlinie",
    "privacy_last_updated": "Zuletzt aktualisiert: 20. Juli 2025",
    "privacy_section1_title": "Umgang mit Bildern",
    "privacy_section1_text": "Die von Ihnen hochgeladenen Bilder werden ausschließlich zum Zweck der Optimierung an unsere sicheren Cloud-Server (Amazon S3 und Netlify Functions) gesendet. Originale und optimierte Bilder können vorübergehend gespeichert werden, um die Bereitstellung des Dienstes zu gewährleisten, und werden automatisch gelöscht. Wir greifen nicht auf Ihre Bilder zu, teilen sie nicht und verwenden sie nicht für andere Zwecke.",
    "privacy_section2_title": "Informationen, die wir sammeln",
    "privacy_section2_text": "Wir sammeln keine persönlichen Informationen. Sie müssen kein Konto erstellen oder persönliche Daten angeben, um Image Guy zu nutzen. Wir können datenschutzfreundliche Analysen verwenden, um den Website-Traffic zu überwachen, aber diese Daten sind anonymisiert und verfolgen keine einzelnen Benutzer.",
    "privacy_section3_title": "Drittanbieterdienste",
    "privacy_section3_text": "Unser Dienst basiert auf einer professionellen Cloud-Infrastruktur von Netlify und Amazon Web Services (AWS). Diese Dienste haben ihre eigenen robusten Datenschutz- und Sicherheitsrichtlinien."
  },
  "zh": {
    "nav_blog": "博客",
    "nav_about": "关于",
    "nav_contact": "联系",
    "footer_privacy": "隐私政策",
    "footer_terms": "服务条款",
    "footer_copyright": "&copy; 2025 Image-Guy.com | 版权所有。",
    "home_title": "智能图像优化与编辑器",
    "home_subtitle": "在几秒钟内即时调整、压缩、转换和裁剪您的图像。免费且安全。",
    "home_upload_title": "将您的文件拖放到此处",
    "home_upload_or": "或",
    "home_upload_button": "选择文件",
    "home_mission_title": "一小步，一像素。",
    "home_mission_text": "您优化的每一张图片不仅节省空间，还节省能源。更少的数据传输和存储意味着更小的数字足迹，为一个更健康的地球做出贡献。加入我们，让网络更快、更环保。",
    "home_howitworks_title": "只需3个简单步骤",
    "home_howitworks_step1_title": "1. 上传",
    "home_howitworks_step1_text": "拖放或选择您的图像。选择输出格式，并根据需要调整质量。请确保您有网络连接。",
    "home_howitworks_step2_title": "2. 优化",
    "home_howitworks_step2_text": "我们的服务器会智能地优化您的图像，在最小的文件大小和最佳的质量之间找到完美的平衡。",
    "home_howitworks_step3_title": "3. 编辑和下载",
    "home_howitworks_step3_text": "裁剪、比较和下载您新的、尺寸完美的图像，可以作为单个文件或方便的.ZIP压缩包下载。",
    "home_announcement": "亲爱的用户，裁剪后的比较功能正在改进中。欢迎随时向我提供您的反馈！",
    "contact_title": "联系我们",
    "contact_intro": "如果您有任何问题、反馈或建议，我们很乐意听取。联系我们的最佳方式是通过电子邮件。",
    "contact_email_header": "电子邮件",
    "contact_phone_header": "商务电话",
    "contact_outro": "我们会尽力尽快给您回复。",
    "about_title": "关于 Image Guy",
    "about_mission": "我们的使命是为每个人提供一个快速、免费且易于使用的工具来优化他们的网络图像。我们相信一个更快、更高效、更环保的互联网。",
    "about_why_header": "为什么要优化？",
    "about_why_text": "您优化的每一张图片不仅能提高您网站的加载速度，还能减少数据传输和存储所需的能源。这意味着更小的数字足迹，为更可持续的地球做出虽小但有意义的贡献。",
    "about_tech_header": "我们的技术",
    "about_tech_text": "Image Guy 由高性能的 `sharp` 库驱动，运行在可扩展的无服务器架构上。这使我们能够为JPEG、PNG、WebP和AVIF等各种格式提供顶级的优化，而不会影响质量。",
    "blog_title": "Image Guy 博客",
    "blog_subtitle": "关于图像优化和网络性能的提示、技巧和见解。",
    "blog_post1_title": "为什么图像优化对您的网站很重要？",
    "blog_post1_excerpt": "了解为什么优化图像对网站速度、可持续性和SEO至关重要，并提供改善网络性能的实用技巧。",
    "blog_read_more": "阅读更多 &rarr;",
    "terms_title": "服务条款",
    "terms_last_updated": "最后更新：2025年7月20日",
    "terms_section1_title": "1. 接受条款",
    "terms_section1_text": "通过访问和使用 Image Guy（“本服务”），您接受并同意受本协议的条款和规定约束。",
    "terms_section2_title": "2. 服务描述",
    "terms_section2_text": "Image Guy 是一个免费使用的网络工具，允许用户优化和压缩图像文件。本服务按“原样”和“现有”基础提供，不作任何保证。",
    "terms_section3_title": "3. 用户责任",
    "terms_section3_text": "您对上传的内容（图像）负全部责任。您必须确保您拥有处理通过本服务处理的任何内容的必要权利和许可。您同意不上传任何非法、有害或其他令人反感的内容。",
    "terms_section4_title": "4. 知识产权",
    "terms_section4_text": "我们对您上传的图像不主张任何所有权。您内容的知识产权完全属于您。本网站的设计、标志和“Image Guy”品牌是本网站的财产。",
    "terms_section5_title": "5. 免责声明",
    "terms_section5_text": "我们对可能发生的任何数据丢失或质量下降概不负责。我们保留因滥用或滥用服务而阻止任何用户使用本服务的权利。",
    "privacy_title": "隐私政策",
    "privacy_last_updated": "最后更新：2025年7月20日",
    "privacy_section1_title": "图像处理",
    "privacy_section1_text": "您上传的图像被发送到我们的安全云服务器（Amazon S3 和 Netlify Functions），其唯一目的是进行优化。原始和优化后的图像可能会被临时存储以确保服务交付，并会自动删除。我们不会出于任何其他目的访问、共享或使用您的图像。",
    "privacy_section2_title": "我们收集的信息",
    "privacy_section2_text": "我们不收集任何个人信息。您无需创建帐户或提供任何个人数据即可使用 Image Guy。我们可能会使用注重隐私的分析来监控网站流量，但这些数据是匿名的，不会跟踪个人用户。",
    "privacy_section3_title": "第三方服务",
    "privacy_section3_text": "我们的服务建立在由 Netlify 和 Amazon Web Services (AWS) 提供的专业云基础设施之上。这些服务拥有自己强大的隐私和安全政策。"
  }
}